{
  "meta": {
    "version": 1,
    "source": "Francisca Moore CV.pdf",
    "last_updated": "2026-01-20"
  },
  "profile": {
    "name": "Francisca Moore",
    "title": {
      "es": "Desarrollador de Software Frontend",
      "en": "Frontend Software Developer"
    },
    "contact": {
      "phone": "+56 9 7351 8292",
      "email": "fraanmoore@gmail.com",
      "links": {
        "linkedin": {
          "es": "https://www.linkedin.com/in/francisca-moore-morales/",
          "en": "https://www.linkedin.com/in/francisca-moore-morales/?locale=en_US"
        },
        "github": "https://github.com/FraanMoore"
      },
      "location": {
        "es": "Temuco, Chile",
        "en": "Temuco, Chile"
      }
    }
  },
  "summary": {
    "es": [
      "Desarrolladora de software frontend especializada en React y TypeScript, con experiencia profesional en el desarrollo de aplicaciones web complejas en entornos de producción. Enfocada en la construcción de interfaces mantenibles, optimización de rendimiento y resolución de desafíos técnicos con una mirada orientada al producto.",

      "Con experiencia en manejo avanzado de estado, integración y consumo de APIs, y colaboración cercana con equipos de diseño y backend, priorizando de forma constante la calidad del código, la escalabilidad y la experiencia de usuario.",

      "Busco integrarme a un equipo donde pueda seguir creciendo técnicamente y aportar al desarrollo de productos sólidos, escalables y de alto impacto."
    ],
    "en": [
      "Frontend software developer specialized in React and TypeScript, with professional experience building complex web applications in production environments. Focused on creating maintainable user interfaces, optimizing performance, and solving technical challenges with a strong product-oriented mindset.",

      "Experienced in advanced state management, API integration, and close collaboration with design and backend teams, consistently prioritizing code quality, scalability, and user experience.",

      "Looking to join a team where I can continue growing technically while contributing to the development of robust, scalable, and high-impact products."
    ]
  },
  "experience": [
    {
      "company": "EVISIT",
      "location": {
        "es": "ARIZONA, ESTADOS UNIDOS",
        "en": "ARIZONA, UNITED STATES"
      },
      "role": {
        "es": "INGENIERA DE SOFTWARE",
        "en": "SOFTWARE ENGINEER"
      },
      "start_year": 2024,
      "end_year": 2026,
      "bullets": {
        "es": [
          "Desarrollo y mantenimiento de aplicaciones de software con foco en estabilidad, escalabilidad y calidad.",
          "Implementación de nuevas funcionalidades y mejoras continuas en entornos productivos.",
          "Integración y consumo de APIs, junto con la implementación y mantenimiento de la lógica de negocio.",
          "Corrección de errores, refactorización y optimización del código, respaldadas por pruebas unitarias e integrales con Jest y React Testing Library, mejorando la confiabilidad del sistema y reduciendo regresiones en producción.",
          "Colaboración con equipos multidisciplinarios en el análisis de requerimientos y definición de soluciones técnicas.",
          "Aplicación consistente de buenas prácticas de desarrollo, priorizando performance, calidad del código y sostenibilidad a largo plazo."

        ],
        "en": [
          "Development and maintenance of software applications with a focus on stability, scalability, and quality.",
          "Implementation of new features and continuous improvements in production environments.",
          "API integration and consumption, including the implementation and maintenance of business logic.",
          "Bug fixing, code refactoring, and optimization, supported by unit and integration tests using Jest and React Testing Library to improve reliability and maintainability.",
          "Collaboration with cross-functional teams to analyze requirements and define technical solutions.",
          "Consistent application of best development practices, prioritizing performance, code quality, and long-term sustainability."
        ]
      },
      "tags": ["software-development", "frontend", "product-mindset", "performance", "apis"]
    },
    {
      "company": "TURISMO COCHA",
      "location": {
        "es": "TEMUCO, CHILE",
        "en": "TEMUCO, CHILE"
      },
      "role": {
        "es": "ADMINISTRADOR DE FINANZAS",
        "en": "FINANCE ADMINISTRATOR"
      },
      "start_year": 2021,
      "end_year": 2024,
      "bullets": {
        "es": [
          "Mantención de comunicación directa y efectiva con clientes, enfocada en la resolución de consultas relacionadas con pagos y facturación.",
          "Entrega de respuestas claras y detalladas sobre estados de cuenta, asegurando la correcta comprensión y satisfacción del cliente.",
          "Colaboración con otras áreas para la mejora continua de los procesos de facturación y la optimización de la experiencia del cliente.",
          "Revisión y análisis de facturas mediante los sistemas Oracle y Travelio.",
          "Carga y gestión de facturas del Servicio de Impuestos Internos en el sistema Oracle."
        ],
        "en": [
          "Maintained direct and effective communication with clients, focusing on resolving billing and payment inquiries.",
          "Provided clear and detailed explanations of account statements to ensure understanding and customer satisfaction.",
          "Collaborated with other teams to continuously improve billing processes and optimize the customer experience.",
          "Reviewed and analyzed invoices using Oracle and Travelio.",
          "Uploaded and managed invoices from the Internal Revenue Service in Oracle."
        ]
      },
      "tags": ["operations", "billing", "customer-communication", "oracle"]
    }
  ],
  "education": [
    {
      "degree": {
        "es": "Full Stack Developer",
        "en": "Full Stack Developer"
      },
      "institution": "4Geek Academy",
      "year": 2023,
      "location": {
        "es": "Santiago, Chile",
        "en": "Santiago, Chile"
      }
    },
    {
      "degree": {
        "es": "Administrador de Turismo y Hotelería",
        "en": "Tourism and Hospitality Administrator"
      },
      "institution": "Instituto Profesional DuocUC",
      "year": 2021,
      "location": {
        "es": "Santiago, Chile",
        "en": "Santiago, Chile"
      }
    }
  ],
  "skills": {
    "core": [
              "JavaScript (ES6+)",
              "TypeScript",
              "React",
              "Redux",
              "React Hooks",
              "RTK Query",
              "react-hook-form"
             ],
    "ui": [
            "HTML5",
            "CSS3",
            "styled-components",
            "Material UI (MUI)"
          ],
    "apis": [
            "REST APIs",
            "OpenAI API"
          ],
    "tooling": [
            "Jest",
            "React Testing Library",
            "Git",
            "GitHub",
            "ESLint",
            "Prettier"
          ]
  },
  "languages": [
    { "name": "Español", "level": { "es": "Nativo", "en": "Native" } },
    { "name": "English", "level": { "es": "Fluido", "en": "Fluent" } },
    { "name": "Português", "level": { "es": "Básico", "en": "Basic" } }
  ]
}

