{
  "meta": {
    "version": 1,
    "source": "Francisca Moore CV.pdf",
    "last_updated": "2026-01-20"
  },
  "profile": {
    "name": "Francisca Moore",
    "title": {
      "es": "Desarrollador de Software",
      "en": "Software Developer"
    },
    "contact": {
      "phone": "+56 9 7351 8292",
      "email": "fraanmoore@gmail.com",
      "links": {
        "linkedin": {
          "es": "https://www.linkedin.com/in/francisca-moore-morales/",
          "en": "https://www.linkedin.com/in/francisca-moore-morales/?locale=en_US"
        },
        "github": "https://github.com/FraanMoore"
      },
      "location": {
        "es": "Temuco, Chile",
        "en": "Temuco, Chile"
      }
    }
  },
  "summary": {
    "es": [
      "Soy desarrolladora de software especializada en frontend, con experiencia en el desarrollo de aplicaciones web complejas. Me enfoco en construir interfaces mantenibles, optimizar el rendimiento y resolver desafíos técnicos con una mirada orientada al producto.",
      "He trabajado con manejo avanzado de estado, consumo de APIs y colaboración cercana con equipos de diseño y backend, priorizando la calidad del código y la experiencia de usuario.",
      "Busco integrarme a un equipo donde pueda seguir creciendo técnicamente y aportar al desarrollo de productos sólidos, escalables y de alto impacto."
    ],
    "en": [
      "I am a frontend-focused software developer with experience building complex web applications. I specialize in creating maintainable interfaces, optimizing performance, and solving technical challenges with a strong product-oriented mindset.",
      "have worked extensively with advanced state management, API integration, and close collaboration with design and backend teams, always prioritizing code quality and user experience.",
      "I am looking to join a team where I can continue growing technically while contributing to the development of robust, scalable, and high-impact products."
    ]
  },
  "experience": [
    {
      "company": "EVISIT",
      "location": {
        "es": "ARIZONA, ESTADOS UNIDOS",
        "en": "ARIZONA, UNITED STATES"
      },
      "role": {
        "es": "INGENIERA DE SOFTWARE",
        "en": "SOFTWARE ENGINEER"
      },
      "start_year": 2024,
      "end_year": 2026,
      "bullets": {
        "es": [
          "Desarrollo y mantención de aplicaciones de software orientadas a estabilidad, escalabilidad y calidad.",
          "Implementación de nuevas funcionalidades y mejoras continuas del sistema.",
          "Integración con APIs y manejo de lógica de negocio.",
          "Corrección de errores, factorización y optimización del código.",
          "Colaboración con equipos multidisciplinarios para análisis de requerimientos y definición de soluciones técnicas.",
          "Aplicación de buenas prácticas de desarrollo, con foco en rendimiento y mantenibilidad."
        ],
        "en": [
          "Development and maintenance of software applications with a focus on stability, scalability, and quality.",
          "Implementation of new features and continuous system improvements.",
          "Integration and consumption of APIs, along with the design and maintenance of business logic.",
          "Bug fixing, code refactoring, and optimization to improve performance and maintainability.",
          "Collaboration with cross-functional teams to analyze requirements and define technical solutions.",
          "Consistent application of best development practices, prioritizing performance and software quality."
        ]
      },
      "tags": ["software-development", "frontend", "product-mindset", "performance", "apis"]
    },
    {
      "company": "TURISMO COCHA",
      "location": {
        "es": "TEMUCO, CHILE",
        "en": "TEMUCO, CHILE"
      },
      "role": {
        "es": "ADMINISTRADOR DE FINANZAS",
        "en": "FINANCE ADMINISTRATOR"
      },
      "start_year": 2021,
      "end_year": 2024,
      "bullets": {
        "es": [
          "Mantención de comunicación directa y efectiva con clientes, enfocada en la resolución de consultas relacionadas con pagos y facturación.",
          "Entrega de respuestas claras y detalladas sobre estados de cuenta, asegurando la correcta comprensión y satisfacción del cliente.",
          "Colaboración con otras áreas para la mejora continua de los procesos de facturación y la optimización de la experiencia del cliente.",
          "Revisión y análisis de facturas mediante los sistemas Oracle y Travelio.",
          "Carga y gestión de facturas del Servicio de Impuestos Internos en el sistema Oracle."
        ],
        "en": [
          "Maintained direct and effective communication with clients, focusing on resolving billing and payment inquiries.",
          "Provided clear and detailed explanations of account statements to ensure understanding and customer satisfaction.",
          "Collaborated with other teams to continuously improve billing processes and optimize the customer experience.",
          "Reviewed and analyzed invoices using Oracle and Travelio.",
          "Uploaded and managed invoices from the Internal Revenue Service in Oracle."
        ]
      },
      "tags": ["operations", "billing", "customer-communication", "oracle"]
    }
  ],
  "education": [
    {
      "degree": {
        "es": "Full Stack Developer",
        "en": "Full Stack Developer"
      },
      "institution": "4Geek Academy",
      "year": 2023,
      "location": {
        "es": "Santiago, Chile",
        "en": "Santiago, Chile"
      }
    },
    {
      "degree": {
        "es": "Administrador de Turismo y Hotelería",
        "en": "Tourism and Hospitality Administrator"
      },
      "institution": "Instituto Profesional DuocUC",
      "year": 2021,
      "location": {
        "es": "Santiago, Chile",
        "en": "Santiago, Chile"
      }
    }
  ],
  "skills": {
    "core": ["JavaScript", "TypeScript", "React", "HTML", "CSS"],
    "apis": ["REST API", "JWT"],
    "tooling": ["Git", "GitHub"]
  },
  "languages": [
    { "name": "Español", "level": { "es": "Nativo", "en": "Native" } },
    { "name": "English", "level": { "es": "Fluido", "en": "Fluent" } },
    { "name": "Português", "level": { "es": "Básico", "en": "Basic" } }
  ]
}

